Revit 2026 API

# RebarShapeConstraint Methods

---

The RebarShapeConstraint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetParamId | Return the Id of the parameter associated with this constraint. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

RebarShapeConstraint Class

Autodesk.Revit.DB.Structure Namespace